---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AreInnerRegionsOpenings
source: html/5f33204d-6147-d044-2e34-bb9f3168a2b6.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.AreInnerRegionsOpenings Property

True if inner regions of the extrusion should become openings, false otherwise.

## Syntax (C#)
```csharp
public bool AreInnerRegionsOpenings { get; set; }
```